wikimedia/smash-pig/Tests/IPNTemplates/adyen/auth_success.xml

<?xml version="1.0" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soap:Body>
		<ns1:sendNotification xmlns:ns1="http://notification.services.adyen.com">
			<ns1:notification>
				<live xmlns="http://notification.services.adyen.com">false</live>
				<notificationItems xmlns="http://notification.services.adyen.com">
					<NotificationRequestItem>
						<additionalData>
							<entry>
								<key xsi:type="xsd:string">cvcResult</key>
								<value xsi:type="xsd:string">1 Matches</value>
							</entry>
							<entry>
								<key xsi:type="xsd:string">avsResult</key>
								<value xsi:type="xsd:string">1 Address matches, postal code doesn't</value>
							</entry>
						</additionalData>
						<amount>
							<currency xmlns="http://common.services.adyen.com">[[CURRENCY]]</currency>
							<value xmlns="http://common.services.adyen.com">[[AMOUNT_IN_CENTS]]</value>
						</amount>
						<eventCode>AUTHORISATION</eventCode>
						<eventDate>2016-01-25T17:07:36.862+01:00</eventDate>
						<merchantAccountCode>[[ACCOUNT_CODE]]</merchantAccountCode>
						<merchantReference>[[ORDER_ID]]</merchantReference>
						<operations>
							<string>CANCEL</string>
							<string>CAPTURE</string>
							<string>REFUND</string>
						</operations>
						<originalReference xsi:nil="true"/>
						<paymentMethod>amex</paymentMethod>
						<pspReference>[[PROCESSOR_REF_1]]</pspReference>
						<reason>27533:0003:6/2016</reason>
						<success>true</success>
					</NotificationRequestItem>
				</notificationItems>
			</ns1:notification>
		</ns1:sendNotification>
	</soap:Body>
</soap:Envelope>
